src/cf/src/Documents/ТабельУчётаРабочегоВремени/ТабельУчётаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчётаРабочегоВремени</name>
  <registerRecords>InformationRegister.ОтработанноеВремяСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТабель</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>_1</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_1_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_2</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_2_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_3</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_3_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_4</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_4_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_5</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_5_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_6</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_6_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_7</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_7_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_8</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_8_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_9</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_9_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_10</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_10_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_11</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_11_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_12</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_12_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_13</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_13_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_14</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_14_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_15</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_15_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_16</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_16_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_17</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_17_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_18</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_18_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_19</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_19_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_20</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_20_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_21</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_21_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_22</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_22_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_23</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_23_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_24</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_24_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_25</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_25_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_26</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_26_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_27</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_27_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_28</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_28_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_29</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_29_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_30</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_30_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>_31</name>
      <type>
        <types>DefinedType.ОтработанноеВремяВСутки</types>
      </type>
    </attributes>
    <attributes>
      <name>_31_Вариант</name>
      <type>
        <types>CatalogRef.ВариантыВыходаНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафику</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>Отработано</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоГрафикуДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.ОтработанноеВремя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/ВариантыВыходаНаРаботу/ВариантыВыходаНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыВыходаНаРаботу</name>
  <predefined>
    <items>
      <name>Праздничный</name>
      <description>Férié</description>
    </items>
    <items>
      <name>Больничный</name>
      <description>Maladie</description>
    </items>
    <items>
      <name>Выходной</name>
      <description>Non ouvrable</description>
    </items>
    <items>
      <name>Рабочий</name>
      <description>Ouvrable</description>
    </items>
  </predefined>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ТабельУчётаРабочегоВремени/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВыборПериода(Команда)
	ОформитьТаблицу();
	ОчиститьЗначенияВСкрытыхКолонкахСервер();
	ПосчитатьОтработанныеДни();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	ЗаполнитьНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУстановленным(Команда)
	ЗаполнитьНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТабельПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПосчитатьОтработанныеДни();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьНаСервере(Автоматически)
	УстановитьПривилегированныйРежим(Истина);
	Если Автоматически Тогда
		Объект.ТЧТабель.Очистить();
	КонецЕсли;	
	ВариантВыходаРабочий = Справочники.ВариантыВыходаНаРаботу.Рабочий;
	МасВыходные = РегистрыСведений.ПроизводственныйКалендарь.ПолучитьВыходные(НачалоМесяца(Объект.Дата), КонецМесяца(Объект.Дата));	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник,
	                      |	ТарифныеСтавкиСрезПоследних.Должность КАК Должность,
	                      |	ТарифныеСтавкиСрезПоследних.Оклад КАК Оклад,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы.ВидГрафика КАК ВидГрафика,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы.РабочийДеньЧасов КАК РабочийДеньЧасов,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы.РабочихДней КАК РабочихДней,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы.ВыходныхДней КАК ВыходныхДней,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыГрафиковРаботы.Сменный) КАК ЭтоСменныйГрафик,
	                      |	ВЫБОР
	                      |		КОГДА ТарифныеСтавкиСрезПоследних.ГрафикРаботы.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыГрафиковРаботы.Пятидневный)
	                      |			ТОГДА 5
	                      |		КОГДА ТарифныеСтавкиСрезПоследних.ГрафикРаботы.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыГрафиковРаботы.Шестидневный)
	                      |			ТОГДА 6
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК РабочихДнейВНеделю
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&Дата, ) КАК ТарифныеСтавкиСрезПоследних
	                      |ГДЕ
	                      |	&УсловиеПоСотрудникам");
	// При автозаполнении ТЧ уже очищена, берём всех сотрудников, иначе только тех, кто в табеле.
	УсловиеПоСотрудникам = ?(Автоматически, "ИСТИНА", "ТарифныеСтавкиСрезПоследних.Сотрудник В (&Сотрудники)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСотрудникам", УсловиеПоСотрудникам);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудники", Объект.ТЧТабель.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Автоматически", Автоматически);
	Выб = Запрос.Выполнить().Выбрать();	
	Пока Выб.Следующий() Цикл
		Если Автоматически Тогда
			Стр = Объект.ТЧТабель.Добавить();
			Стр.Сотрудник = Выб.Сотрудник;
		Иначе
			Стр = Объект.ТЧТабель.НайтиСтроки(Новый Структура("Сотрудник", Выб.Сотрудник))[0]; 	
		КонецЕсли;
		МасГрафик = РассчитатьГрафикРаботыСотрудника(Выб, МасВыходные, Объект.Дата);
		Стр.ГрафикРаботы = Выб.ГрафикРаботы; 
		Для А = 1 По День(КонецМесяца(Объект.Дата)) Цикл 
			Если МасГрафик.Найти(А) = Неопределено Тогда
				Стр["_" + А] = 0;
				Стр["_" + А + "_Вариант"] = Неопределено;	
			Иначе
				Стр["_" + А] = Выб.РабочийДеньЧасов;
				Стр["_" + А + "_Вариант"] = ВариантВыходаРабочий;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	ПосчитатьОтработанныеДни();
КонецПроцедуры

&НаСервере
Функция РассчитатьГрафикРаботыСотрудника(ДанныеГрафика, МасВыходные, Дата) Экспорт
	Результат = Новый Массив;
	Если ДанныеГрафика.ЭтоСменныйГрафик Тогда
		ПервыйРабочийДень = ПолучитьПервыйРабочийДеньПоТабелю(ДанныеГрафика.Сотрудник);
		Если ПервыйРабочийДень = 0 Тогда
			Сообщить(Нстр("ru = 'Укажите первый рабочий день для '; fr = 'Spécifiez le premier jour de travail pour'") + СокрЛП(ДанныеГрафика.Сотрудник) + Нстр("fr = ""et cliquez sur le bouton Remplir selon l'établi""; ru = ' и нажмите на кнопку Заполнить по установленным'; en = ' and click on the Fill In according to the set parameters button.'; es = ' y haga clic en el botón Llenar en la configuración'"));
		Иначе
			РабочихДней = 0;
			ВыходныхДней = 0;
			Для Н = ПервыйРабочийДень По День(КонецМесяца(Дата)) Цикл
				Если РабочихДней = 0 и ВыходныхДней = 0 Тогда
					РабочихДней = ДанныеГрафика.РабочихДней;
					ВыходныхДней = ДанныеГрафика.ВыходныхДней;
				КонецЕсли;	
				ДеньМесяца = НачалоМесяца(Дата) + (Н - 1) * 86400;
				Если РабочихДней > 0 Тогда
					// Устанавливаем выход на работу
					Результат.Добавить(День(ДеньМесяца));
					РабочихДней = РабочихДней - 1;
				ИначеЕсли ВыходныхДней > 0 Тогда
					ВыходныхДней = ВыходныхДней - 1;	
				КонецЕсли;				
			КонецЦикла;	
		КонецЕсли;
	ИначеЕсли ДанныеГрафика.РабочихДнейВНеделю = 5 Тогда // Устанавливаем по рабочим дням	
		Для Н = 1 По День(КонецМесяца(Дата)) Цикл
			ДеньМесяца = НачалоМесяца(Дата) + (Н - 1) * 86400;				
			Если МасВыходные.Найти(ДеньМесяца) <> Неопределено Тогда Продолжить КонецЕсли;
			// Устанавливаем выход на работу
			Результат.Добавить(День(ДеньМесяца));
		КонецЦикла;		
	Иначе // Устанавливаем по порядку		
		Для Н = 1 По День(КонецМесяца(Дата)) Цикл
			ДеньМесяца = НачалоМесяца(Дата) + (Н - 1) * 86400;				
			Если ДеньНедели(ДеньМесяца) > ДанныеГрафика.РабочихДнейВНеделю Тогда Продолжить КонецЕсли;
			// Устанавливаем выход на работу
			Результат.Добавить(День(ДеньМесяца));
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОформитьТаблицу()
	ЦветФонаВыходногоДня = Новый Цвет(166, 202, 240);
	ЦветТекстаВыходногоДня = Новый Цвет(255, 0, 0);
	ЦветФонаРабочегоДня = Новый Цвет;
	ЦветТекстаРабочегоДня = Новый Цвет;
	ТекДата = НачалоМесяца(Объект.Дата);
	КонецПериода = КонецМесяца(Объект.Дата);
	Пока ТекДата < КонецПериода Цикл
		НомерДня = День(ТекДата);
		НомерДняНедели = ДеньНедели(ТекДата);		
		Элементы["ТЧТабель_" + НомерДня].Заголовок = СокрЛП(НомерДня) + " (" + Формат(ТекДата, "ДФ=ддд") + ")";
		Если НомерДняНедели > 5 Тогда // это выходные
			Элементы["ТЧТабель_" + НомерДня].ЦветФона = ЦветФонаВыходногоДня;
			Элементы["ТЧТабель_" + НомерДня + "_Вариант"].ЦветФона = ЦветФонаВыходногоДня;
			Элементы["ТЧТабель_" + НомерДня].ЦветТекстаЗаголовка = ЦветТекстаВыходногоДня;
			Элементы["ТЧТабель_" + НомерДня + "_Вариант"].ЦветТекстаЗаголовка = ЦветТекстаВыходногоДня;
		Иначе
			Элементы["ТЧТабель_" + НомерДня].ЦветФона = ЦветФонаРабочегоДня;
			Элементы["ТЧТабель_" + НомерДня + "_Вариант"].ЦветФона = ЦветФонаРабочегоДня;
			Элементы["ТЧТабель_" + НомерДня].ЦветТекстаЗаголовка = ЦветТекстаРабочегоДня;
			Элементы["ТЧТабель_" + НомерДня + "_Вариант"].ЦветТекстаЗаголовка = ЦветТекстаРабочегоДня;
		КонецЕсли;
		ТекДата = ТекДата + 24 * 60 * 60;
	КонецЦикла;
	// Сделаем все видимыми
	Для А = 1 По 31 Цикл
		Элементы["ТЧТабельГруппа" + А].Видимость = Истина;
	КонецЦикла;
	// Сделаем лишние невидимыми
	ДнейВМесяце = День(КонецПериода) + 1;
	Для А = ДнейВМесяце По 31 Цикл
		Элементы["ТЧТабельГруппа" + А].Видимость = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗначенияВСкрытыхКолонкахСервер()
	ДнейВМесяце = День(КонецМесяца(Объект.Дата)) + 1;
	Для Каждого Стр Из Объект.ТЧТабель Цикл
		Для А = ДнейВМесяце По 31 Цикл
			Стр["_" + А] = Ложь;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПосчитатьОтработанныеДни()
	Для Каждого Стр Из Объект.ТЧТабель Цикл
		РабочийДеньЧасов = Стр.ГрафикРаботы.РабочийДеньЧасов;
		Стр.ПоГрафику = 0;
		Стр.Отработано = 0;
		Стр.ПоГрафикуДней = 0;
		Стр.ОтработаноДней = 0;
		Для А = 1 По 31 Цикл
			ОтработаноЧасов = Стр["_" + А];
			Вариант = Стр["_" + А + "_Вариант"];
			Если Не ЗначениеЗаполнено(Вариант) Тогда Продолжить КонецЕсли;
			Коэффициент = Вариант.Коэффициент;			
			Стр.ПоГрафику = Стр.ПоГрафику + РабочийДеньЧасов * Коэффициент;
			Стр.Отработано = Стр.Отработано + ОтработаноЧасов * Коэффициент;
			Стр.ПоГрафикуДней = Стр.ПоГрафикуДней + ?(РабочийДеньЧасов = 0, 0, 1);
			Стр.ОтработаноДней = Стр.ОтработаноДней + ?(ОтработаноЧасов = 0, 0, 1);
		КонецЦикла; 	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьПервыйРабочийДеньПоТабелю(Сотрудник)
	Результат = 0;
	ТекДата = НачалоМесяца(Объект.Дата);
	КонецПериода = КонецМесяца(Объект.Дата);
	Мас = Объект.ТЧТабель.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
	Если Мас.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	Пока ТекДата < КонецПериода Цикл
		НомерДня = День(ТекДата);
		Если ЗначениеЗаполнено(Мас[0]["_" + НомерДня + "_Вариант"]) Тогда
			Результат = НомерДня;
			Прервать;
		КонецЕсли;	
		ТекДата = ТекДата + 24 * 60 * 60;
	КонецЦикла;
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ТЧТабельПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТабель.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат; КонецЕсли;
	ТекКолонка = Элемент.ТекущийЭлемент.Имя;
	Если Не Прав(ТекКолонка,8) = "_Вариант" Тогда
		Возврат;
	КонецЕсли;
	ИмяКолонкиВариант = СтрЗаменить(ТекКолонка,"ТЧТабель","");
	Если Не ЗначениеЗаполнено(ТекСтр[ИмяКолонкиВариант]) Тогда 
		ИмяКолонки = СтрЗаменить(ИмяКолонкиВариант,"_Вариант","");
		ТекСтр[ИмяКолонки] = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
